In [1]:
import pandas as pd

C:\Users\raghav.aggarwal\AppData\Local\Temp\ipykernel_12252\217833862.py:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [7]:
data = {'Name': ['Jai', 'Princi', 'Gaurav', 'Anuj'],
        'Height': [5.1, 6.2, 5.1, 5.2],
        'Qualification': ['Msc', 'MA', 'Msc', 'Msc']}
df= pd.DataFrame(data)
print(df)
df.insert(2,"Age",[21,22,23,24])
df

     Name  Height Qualification
0     Jai     5.1           Msc
1  Princi     6.2            MA
2  Gaurav     5.1           Msc
3    Anuj     5.2           Msc

     Name  Height  Age Qualification
0     Jai     5.1   21           Msc
1  Princi     6.2   22            MA
2  Gaurav     5.1   23           Msc
3    Anuj     5.2   24           Msc

In [12]:
address = {'Jai': 'Dehli', 'Princi': 'Banglore',
           'Gaurav': 'Patna', 'Anuj': 'Chennai'}
df['Address']=address
df
# When you try to add the 'Address' column to the DataFrame using df['Address'] = address,
#  pandas attempts to match the keys in the address dictionary with the index (row labels) of the DataFrame. 
# Since there is no direct match, it fills the 'Address' column with NaN (Not a Number) values.

     Name  Height  Age Qualification Address
0     Jai     5.1   21           Msc     NaN
1  Princi     6.2   22            MA     NaN
2  Gaurav     5.1   23           Msc     NaN
3    Anuj     5.2   24           Msc     NaN

In [13]:
address = ['Delhi', 'Bangalore', 'Chennai', 'Patna']    
df['Address'] = address
print(df)

     Name  Height  Age Qualification    Address
0     Jai     5.1   21           Msc      Delhi
1  Princi     6.2   22            MA  Bangalore
2  Gaurav     5.1   23           Msc    Chennai
3    Anuj     5.2   24           Msc      Patna

In [15]:
d=pd.read_csv("nba.csv",index_col="Name")
print(d.head(5))
d.drop(["Avery Bradley", "John Holland", "R.J. Hunter"],inplace=True)
d

                         Team  Number Position   Age Height  Weight  \
Name
Avery Bradley  Boston Celtics     0.0       PG  25.0    6-2   180.0
Jae Crowder    Boston Celtics    99.0       SF  25.0    6-6   235.0
John Holland   Boston Celtics    30.0       SG  27.0    6-5   205.0
R.J. Hunter    Boston Celtics    28.0       SG  22.0    6-5   185.0
Jonas Jerebko  Boston Celtics     8.0       PF  29.0   6-10   231.0

                         College     Salary
Name
Avery Bradley              Texas  7730337.0
Jae Crowder            Marquette  6796117.0
John Holland   Boston University        NaN
R.J. Hunter        Georgia State  1148640.0
Jonas Jerebko                NaN  5000000.0

,Team,Number,Position,Age,Height,Weight,College,Salary
Name,,,,,,,,
Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
Amir Johnson,Boston Celtics,90.0,PF,29.0,6-9,240.0,NaN,12000000.0
Jordan Mickey,Boston Celtics,55.0,PF,21.0,6-8,235.0,LSU,1170960.0
Kelly Olynyk,Boston Celtics,41.0,C,25.0,7-0,238.0,Gonzaga,2165160.0
...,...,...,...,...,...,...,...,...
Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [17]:
# d.sort_values("Name", axis=0, ascending=True,inplace=True, na_position='last')
d.sort_values(["Team", "Name"], axis=0,  ascending=[True,False], inplace=True) 
d

,Team,Number,Position,Age,Height,Weight,College,Salary
Name,,,,,,,,
Walter Tavares,Atlanta Hawks,22.0,C,24.0,7-3,260.0,NaN,1000000.0
Tim Hardaway Jr.,Atlanta Hawks,10.0,SG,24.0,6-6,205.0,Michigan,1304520.0
Tiago Splitter,Atlanta Hawks,11.0,C,31.0,6-11,245.0,NaN,9756250.0
Thabo Sefolosha,Atlanta Hawks,25.0,SF,32.0,6-7,220.0,NaN,4000000.0
Paul Millsap,Atlanta Hawks,4.0,PF,31.0,6-8,246.0,Louisiana Tech,18671659.0
...,...,...,...,...,...,...,...,...
Garrett Temple,Washington Wizards,17.0,SG,30.0,6-6,195.0,LSU,1100602.0
Drew Gooden,Washington Wizards,90.0,PF,34.0,6-10,250.0,Kansas,3300000.0
Bradley Beal,Washington Wizards,3.0,SG,22.0,6-5,207.0,Florida,5694674.0
Alan Anderson,Washington Wizards,6.0,SG,33.0,6-6,220.0,Michigan State,4000000.0
NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN